In [1]:
import pandas as pd
import numpy as np

In [2]:
matrix_data=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')

row_labels=['Raju','Pandey','Srini','Sunil','Ashok']

column_headings=['Age','Height','Weight']

In [3]:
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=column_headings)
print('\n A new DataFrame\n','-'*25,sep='')
print(df)

 A new DataFrame
-------------------------
        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [4]:
#extracting data from a particular column
df['Height']

Raju      66
Pandey    70
Srini     62
Sunil     68
Ashok     62
Name: Height, dtype: int32

In [5]:
type(df['Height'])

pandas.core.series.Series

In [6]:
#ectracting data from multiple coulmns
df[['Height','Weight']]

        Height  Weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [10]:
#Column can be extracted in this way too
df.Age

Raju      22
Pandey    42
Srini     30
Sunil     35
Ashok     25
Name: Age, dtype: int32

# Lets understand slicing particular element

In [7]:
#select particular index data using loc(location)(Index name)

In [8]:
df.loc["Raju"]

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [9]:
#Select particular index data from iloc(index location)(index number)
df.iloc[0]

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [10]:
#suppose we want particular data about a particular candidate
df.loc['Pandey','Height']

70

In [14]:
# suppose we want multiple but not all data about a particular person
df.loc['Ashok',['Height','Weight']]

Height     62
Weight    152
Name: Ashok, dtype: int32

In [13]:
#suppose we want multiple but not all data about multiple person but not all person
df.loc[['Srini','Sunil'],['Height','Weight']]

       Height  Weight
Srini      62     125
Sunil      68     160

# Select data on condition

In [15]:
#All data of persons with height greater than 65
df[df['Height']>65]

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Sunil    35      68     160

In [18]:
#Print rows with Height>65 and Weight>145(Since 'and' is used here, both the conditions should be satisfied.)
df[(df['Height']>65) & (df['Weight']>145)]

        Age  Height  Weight
Pandey   42      70     148
Sunil    35      68     160

In [21]:
#DataFrame with only Age and Weight columns whose Height>65 inch
df[(df['Height']>65)][['Age','Weight']]

        Age  Weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [23]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [24]:
#reset_index brings in the original index locations
df.reset_index()

    index  Age  Height  Weight
0    Raju   22      66     140
1  Pandey   42      70     148
2   Srini   30      62     125
3   Sunil   35      68     160
4   Ashok   25      62     152

In [25]:
df   #effect of reset_index is not permanent

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [27]:
#Keep only the rows in the DataFrame which has Age<35 and the changes should be permanent
df=df[df['Age']<35]
df

       Age  Height  Weight
Raju    22      66     140
Srini   30      62     125
Ashok   25      62     152

In [28]:
#Now removing the old index
df.reset_index(drop=True)    #press shift+tab to view all possible options

   Age  Height  Weight
0   22      66     140
1   30      62     125
2   25      62     152

In [29]:
df #the changes due to reset_index(drop=True) are not permanent

       Age  Height  Weight
Raju    22      66     140
Srini   30      62     125
Ashok   25      62     152

In [30]:
#Now adding a new column to the DataFrame
df['Profession']="Student Teacher Engineer".split() #split() command separates on the basis of spaces.

In [31]:
df

       Age  Height  Weight Profession
Raju    22      66     140    Student
Srini   30      62     125    Teacher
Ashok   25      62     152   Engineer

In [32]:
#Now we are setting the profession as index
df.set_index('Profession')

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      30      62     125
Engineer     25      62     152

In [33]:
df #use inplace=True in the above command to make the effect permanent

       Age  Height  Weight Profession
Raju    22      66     140    Student
Srini   30      62     125    Teacher
Ashok   25      62     152   Engineer

In [34]:
df.set_index('Profession',drop=False) #effect not permanent #press shift+tab to view all possible options.

            Age  Height  Weight Profession
Profession
Student      22      66     140    Student
Teacher      30      62     125    Teacher
Engineer     25      62     152   Engineer

In [35]:
df.set_index('Profession',append=True) #effect not permanent # press shift+tab to view all possible options

                  Age  Height  Weight
      Profession
Raju  Student      22      66     140
Srini Teacher      30      62     125
Ashok Engineer     25      62     152

In [36]:
df

       Age  Height  Weight Profession
Raju    22      66     140    Student
Srini   30      62     125    Teacher
Ashok   25      62     152   Engineer